namespace DZLinq2Db
{
    //Выбрать какую БД использовать(из задания "Sql запросы" или "Кластерный индекс"), написать строку подключения к БД и
    //использовать ее для подключения. (опираться можно на пример из материалов)
    //Создать классы, которые описывают таблицы в БД
    //Используя ORM выполнить простые запросы к каждой таблице, выполнить параметризованные запросы к каждой таблице
    //(без JOIN) - 2-3 запроса на таблицу.
    //Значения параметров для фильтрации можно как задавать из консоли, так и значениями переменных в коде. (пример GetStudent)
    //Выполнить все запросы, из выбранного ранее задания с передачей параметров.
    internal partial class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");

        }
    }

}
